tests/attendee-script.yml
config:
  target: "wss://stage.events.q4inc.com/graphql?x-meeting-id=298827828&x-company-id=5ff782c52dab34000885fe61&ep-wss=true"
  ensure:
    max: 5000 # fail if max response time exceeds 2000ms
    maxErrorRate: 0 # fail if error rate exceeds 2%
  phases:
    - duration: 600           # 10 min
      arrivalRate: 166         # 100 requests per second
      # rampTo: 332             # 1000 requests per second
      name: "Perform Attendee load test 600-332"
  ws:
    rejectUnauthorized: false
    token: "Bearer "
    headers:
      Sec-WebSocket-Protocol: graphql-transport-ws
scenarios:
  - name: "Perform Attendee http journey to console"
    flow:
      - post:
          url: "https://stage.events.q4inc.com/graphql"
          json:
            operationName: "getFeatureFlags"
            query: |
              query getFeatureFlags {
                getFeatureFlags
              }
      - get:
          url: "https://stage.events.q4inc.com/rest/event/298827828"
      - get:
          url: "https://stage.events.q4inc.com/rest/event/features?eventType=earnings"
      - get:
          url: "https://stage.events.q4inc.com/rest/organization/public-user-info?idToken="
      - think: 2
      - get:
          url: "https://stage.events.q4inc.com/rest/event/298827828"
      - get:
          url: "https://stage.events.q4inc.com/rest/event/features?eventType=earnings"
      - post:
          url: "https://stage.events.q4inc.com/graphql"
          json:
            operationName: "getFeatureFlags"
            query: |
              query getFeatureFlags {
                getFeatureFlags
              }
      - post:
          url: "https://stage.events.q4inc.com/rest/auth/guest/login"
          json:
            meetingId: "298827828"
      - post:
          url: "https://stage.events.q4inc.com/graphql"
          headers:
            Authorization: "Bearer "
          json:
            operationName: "createAttendee"
            query: |
              mutation createAttendee(
                $meetingId: Int!
                $email: String!
                $firstName: String!
                $lastName: String!
                $investorType: InvestorTypeNames
                $attendeeType: AttendeeType
                $companyName: String
                $titleAtCompany: String
                $wsConnectionId: String!
                $controlNumber: String
                $upperShareRange: Int
                $lowerShareRange: Int
                $sendReminderEmail: Boolean
                $registrationType: String
                $type: UserType
                $institutionId: String
                $registrationFieldAnswers: [RegistrationFieldAnswerInput]
              ) {
                createAttendee(
                  meetingId: $meetingId
                  email: $email
                  firstName: $firstName
                  lastName: $lastName
                  investorType: $investorType
                  attendeeType: $attendeeType
                  companyName: $companyName
                  titleAtCompany: $titleAtCompany
                  wsConnectionId: $wsConnectionId
                  controlNumber: $controlNumber
                  upperShareRange: $upperShareRange
                  lowerShareRange: $lowerShareRange
                  sendReminderEmail: $sendReminderEmail
                  registrationType: $registrationType
                  type: $type
                  institutionId: $institutionId
                  registrationFieldAnswers: $registrationFieldAnswers
                ) {
                  id
                  meetingId
                  email
                  firstName
                  lastName
                  investorType
                  attendeeType
                  companyName
                  titleAtCompany
                  wsConnectionId
                  controlNumber
                  hasCompletedAttestationForm
                  upperShareRange
                  lowerShareRange
                  sendReminderEmail
                  registrationType
                  type
                  institutionId
                }
              }
            variables:
              attendeeType: "GUEST"
              email: "loading_test@gmail.com"
              firstName: "Loading"
              investorType: "individual"
              lastName: "Test"
              meetingId: 298827828
              registrationType: "LOBBY"
              type: "GUEST"
              wsConnectionId: "6ae00c1a-1049-4b0f-b2eb-68bc74369a0c"
      - loop:
          - post:
              url: "https://stage.events.q4inc.com/graphql"
              headers:
                Authorization: "Bearer "
              json:
                operationName: "getEventBroadcastStatus"
                query: |
                  query getEventBroadcastStatus($meetingId: Int!) {
                    getEventBroadcastStatus(meetingId: $meetingId) {
                      status
                      context
                      startTime
                      broadcastUrl
                    }
                  }
                variables:
                  meetingId: 298827828
          - think: 25
        count: 5  
      - post:
          url: "https://stage.events.q4inc.com/graphql"
          headers:
            Authorization: "Bearer "
          json:
            operationName: "getUserControlledSlides"
            query: |
              query getUserControlledSlides($meetingId: Int) {
                getUserControlledSlides(meetingId: $meetingId)
              }
            variables:
              meetingId: 298827828
      - post:
          url: "https://stage.events.q4inc.com/graphql"
          headers:
            Authorization: "Bearer "
          json:
            operationName: "createPreCallSession"
            query: |
              mutation createPreCallSession {
                createPreCallSession {
                  sessionId
                  token
                }
              }
      - post:
          url: "https://stage.events.q4inc.com/graphql"
          headers:
            Authorization: "Bearer "
          json:
            query: |
              query myQuestion($userEmail: String!) {
                myQuestions(userEmail: $userEmail) {
                  userId
                  text
                  createdAt
                  isAnonymous
                  id
                  upperShareRange
                  lowerShareRange
                }
              }
            variables:
              userEmail: "dmytro.kukharenko@q4inc.com"
      - post:
          url: "https://stage.events.q4inc.com/graphql"
          headers:
            Authorization: "Bearer "
          json:
            query: |
              query ($meetingId: Int) {
                getAssets(contentType: "MATERIALS", meetingId: $meetingId) {
                  assets
                }
              }
            variables:
              meetingId: 298827828
  - engine: "wsgql"
    name: "Perform Attendee subscription journey to console"
    flow:
      - think: 1
      - send: {
          "id": "1",
          "type": "subscribe",
          "payload": {
            "variables": {
              meetingId: 298827828
            },
            "extensions": {},
            "operationName": "FEATURE_FLAG_SUBSCRIPTION",
            "query": "subscription FEATURE_FLAG_SUBSCRIPTION { onFeatureFlagsChange }"
          }
        }
      - send: {
          "id": "2",
          "type": "subscribe",
          "payload": {
            "variables": {
              meetingId: 298827828
            },
            "extensions": {},
            "query": "subscription ($meetingId: Int) {
              onEventStartPeriodUpdated(meetingId: $meetingId) {
                event {
                  meetingId
                  branding {
                    registrationPageBranding {
                      broadridgeTelephoneNumber 
                      broadridgeInternationalTelephoneNumber 
                      title 
                      description 
                      openRegistration 
                      proxyWebsiteLink
                      termsAndConditionsUrl
                    }
                  }
                }
                isEventStarted
              }
            }"
          }
        }
      - send: {
          "id": "3",
          "type": "subscribe",
          "payload": {
            "variables": {
              meetingId: 298827828
            },
            "extensions": {},
            "query": "subscription ($meetingId: Int) {
              onAssetsUpdated(meetingId: $meetingId, contentType: SLIDES)
            }"
          }
        }
      - send: {
          "id": "4",
          "type": "subscribe",
          "payload": {
            "variables": {
              meetingId: 298827828
            },
            "extensions": {},
            "operationName": "BROADCAST_STATUS_SUBSCRIPTION",
            "query": "subscription BROADCAST_STATUS_SUBSCRIPTION($meetingId: Int) {
              onBroadcastStatusUpdated(meetingId: $meetingId) {
                status
                context
                startTime
                broadcastUrl
              }
            }"
          }
        }
      - send: {
          "id": "5",
          "type": "subscribe",
          "payload": {
            "variables": {
              meetingId: 298827828
            },
            "extensions": {},
            "query": "subscription ($meetingId: Int) {
              onEventDisasterRecoveryUpdated(meetingId: $meetingId) {
                enabled
                redirectUrl
              }
            }"
          }
        }
      - send: {
          "id": "6",
          "type": "subscribe",
          "payload": {
            "variables": {
              meetingId: 298827828
            },
            "extensions": {},
            "operationName": "QUESTION_STATUS_SUBSCRIPTION",
            "query": "subscription ($meetingId: Int) {
              onEventQuestionSettingUpdated(meetingId: $meetingId) {
                settings {
                  questionEnabled
                }
              }
            }"
          }
        }
      - think: 600